answer = {3 : "略", 10 : "(1) 0.8\n(2) 0.3\n(3) 0.2\n(4) 0.1\n(5) 0.1", 18 : "(1) 19/39\n(2) 34/39\n(3) 25/39", 19 : "(1) 1/20825\n(2) 11/4165\n(3) 4154/4165\n(4) 0.2813", 21 : "P1 = 1/16\nP2 = 9/16\nP3 = 1/16", 23 : "(1) 0.3838\n(2) 0.5138", 24 : "5/9", 31 : "(1) 32/45\n(2) 9/32", 32 : "(1) 0.1612\n(2) 0.3573", 35 : "你在期待什么，爬", 36 : "你在期待什么，爬", 38 : "Ⅱ可靠性大", 39 : "P(A) = P(B) = 1/2"}
'''
懒人福利
for ans in answer.items():
    print(ans)
'''
a = 998244353
a = int(input("查询请输入题号，退出请输入0: "))
while(a != 0):
    try:
        print(answer[a])
    except Exception as result:
        print("本次作业没有该题")
    finally:
        a = int(input("查询请输入题号，退出请输入0："))